{
    "posts": [
        {
            "title": "The Moment I've Been Waiting For",
            "date": "4/12/12",
            "body": "<p>So my last blog post was way back in November, and I promised all kinds of crazy awesome. Well here we are six months later and I think I've delivered.</p><h3 id=\"what-took-so-long-well-for-starters\">What took so long? Well, for starters:</h3><ul><li>I actually have homework to do. I’ve only been able to work on Keeba on long weekends and breaks, and so now come Spring break I’ve finally had the time to flesh out a solid 1.0 release.</li><li>It’s hard freakin’ work. I’m using some seriously bleeding-edge (and super cool) technology, but that comes at the price of intuitiveness and familiarity. I’ve poured dozens of hours of research into this, all the way back since early last year when I first started hacking on this project.</li><li>Lots and lots of code. While the net total lines of code is still relatively modest given the scope of this project, the amount of iterations and refactors to what is now a very mature and stable codebase is tremendous.</li></ul><h3 id=\"and-now-some-statsinfo-for-the-nerdycurious\">And now some stats/info for the nerdy/curious:</h3><ul><li>Over 7,000 songs were played during the creation of Keeba thus far.</li><li>More than 67,000 lines of code have been modified since the inception of Keeba.</li><li>Both the front and backend servers are now Node.js</li><li>Backbone powers the client with WebSockets (via Socket.IO) for the transport layer</li><li>MongoDB via the Mongoose ORM is doing all the database handling</li><li>I fork the backend parsing server per-user-per-global-session because it’s CPU-bound and would block the node eventloop otherwise.</li></ul><h3 id=\"english-please\">English, please!</h3><p>In other words, I’ve worked my ass off on this. Of course I’ve loved most every moment of it. So at this point, I’d say Keeba is pretty much ready for you (if you’re reading this) to use. Obviously there may (read: will) be some bugs still on the loose, but things should generally be stable and secure.</p><h3 id=\"room-for-improvement\">Room for improvement</h3><p>No, I’m not going to make any MAJOR changes <em>any</em> time soon. But there are a number of areas with room for improvement.</p><ul><li>Importing/syncing homework with the school’s homework website could be better.<li>iPhone app?</li><li>More tools for editing homework</li><li>Easier date picking</li><li>Smarter/faster refresh logic and friendlier messages (though it is WAY faster and smarter than before)</li><li>More tests for durability</li><li>Some areas for code refactoring</li></ul><h3 id=\"go-forth-and-test\">Go forth and test</h3><p>Please report any and all feedback/bugs/comments/questions/concerns/hatemail to my email. Or just text me or hit me up on Facebook or something. Or I guess you could actually use some sort of physical communication, if people still do that.</p><p>xoxo,</p>"
        },
        {
            "title": "Technical overhaul (or why Keeba hasn't been updated in a while)",
            "date": "12/6/11",
            "body": "<p>So undoubtedly many of you have noticed that Keeba has had little to no updates in the past two weeks or so. While some of this can be attributed to school being mad intense lately, there is a deeper evil at work here.</p><p>I’ll try to lay this out as simply and non-technically as possible, so here goes.</p><p>Basically, Keeba grew too fast. No longer is it the simple experiment it started off as – with a barely functional data sink (data sink = the place something gets its data, and for Keeba, that means the code that actually translates the homework website’s information into keeba-workable data), a simple list view of your homework, and no frills like color coding, task management, or advanced sorting.</p><p>So, despite getting TONS of feedback and ideas from the bunch of you who use Keeba daily, Keeba’s code keep getting more and more stretched. New features began taking quite a bit of hacking and tinkering to implement, and things got exponentially more difficult to debug.</p><p>I am hereby announcing my plans to overhaul the front-end of Keeba. Meaning, quite a lot of work that will be completely invisible to you, but will make adding much more advanced features down the line (and finishing existing ones) much easier and less painful.</p><p>Some things off the top of my head that this re-vamp will facilitate include:</p><ul><li>GAH! I hit the ‘refresh’ button and now I have to log in again!</li><li>GAH! The back button on my browser does NOTHING with Keeba!</li><li>GAH! Why is editing courses so buggy?</li><li>GAH! Why hasn’t he added task management yet!?</li><li>GAH! Where’s that damned settings window, and why does it do NOTHING!?!?!</li></ul><p>Etc etc.</p><p>So basically it’s going to be a little longer to overhaul up front, but going forward things should go much more smoothly.</p><p>I am going to try to develop with an experimental version of Keeba while these sweeping (read: everything breaking) changes roll out. So Keeba shouldn’t need to be taken down much if at all during this ordeal.</p><p>Thanks for your patience and feedback!</p>"
        },
        {
            "title": "Obligatory useless first post",
            "body": "<p>News goes here.</p><p>Oh wait, I don’t have any news because I spent a whopping five minute setting this SUPER sophisticated blog up. There will be news, though. I promise.</p><p>TO-DO:<br /> [x] Set up a state-of-the-art blog.</p><p>[ ] Actually work on Keeba.</p>",
            "date": "11/29/11"
        }
    ]
}